# pandas Day 1

In [2]:
import pandas as pd

In [3]:
df =  pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                  delimiter='\t'
                          )   
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [159]:
df.index # info about index start and end

RangeIndex(start=0, stop=156, step=1)

In [27]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [28]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [29]:
df.shape # 891 rows and 12 column

(156, 12)

In [31]:
# selecting the data by its type & describe it 
df.select_dtypes(include='object').describe()

                           Name   Sex  Ticket        Cabin Embarked
count                       156   156     156           31      155
unique                      156     2     145           28        3
top     Emir, Mr. Farred Chehab  male  237736  C23 C25 C27        S
freq                          1   100       2            2      110

In [35]:
df.select_dtypes(include='object').describe().index

Index(['count', 'unique', 'top', 'freq'], dtype='object')

# #

In [45]:
# getting the list of specific dtypes columns
df.dtypes[ df.dtypes=='object'].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [46]:
df.dtypes[df.dtypes=='int64']

PassengerId    int64
Survived       int64
Pclass         int64
SibSp          int64
Parch          int64
dtype: object

In [164]:
df.select_dtypes(include='object').describe().columns

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [49]:
list_col = df.dtypes[df.dtypes=='object'].index
list_col

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [55]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [58]:
df[['Survived','Pclass',"Sex",'Age']].head()

   Survived  Pclass     Sex   Age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [70]:
#checking the null_values()
df.Sex.isnull().value_counts()

False    156
Name: Sex, dtype: int64

In [73]:
df.Sex.isna().sum() # total null/na values

0

## sorted()

In [79]:
sorted(df.Name)[5:10:2]  #  it's in the format of list 
# so we can't use .head() fun
# we use list indexing methos [start:stop:step]

['Andersson, Mr. August Edvard ("Wennerstrom")',
 'Andrew, Mr. Edgardo Samuel',
 'Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)']

# doubt 2

In [181]:
# df.sort_values("Name", ascending=True,axis=1,na_position='last') #  doubt
# df.Age.fillna(0)
df.sort_values(by='Age', ascending=True).head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
119,120,0,3,"Andersson, Miss. Ellis Anna Maria",female,2.00,4,2,347082,31.2750,NaN,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.00,3,1,349909,21.0750,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.00,4,1,382652,29.1250,NaN,Q
43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.00,1,2,SC/Paris 2123,41.5792,NaN,C

In [109]:
df.Name.value_counts(dropna=True).sum()

156

In [102]:
df.Name.duplicated(keep='first').sum()

0

## slicing

In [132]:
#slice methods 
df.Name.loc[0:5] # referint the df index 
df.Name.iloc[0:5 ] # 
#type (df.Name.iloc[0:5 ])  # series object having only one column

pandas.core.series.Series

# changing the datatype of column

# labeling (Nominal data)

## pd.categorical ()

# seclect the labels for the Cabins.
# and assing to the dataframe.

In [4]:
import numpy as np
str_cabin  = df['Cabin'].astype(str) # converting object---> str
# it's neccessary to have data in string format before labeling
first_char = [i[0] for i in str_cabin] # selecting the first letter of the elemets present in str_cabin
new_cabin = pd.Categorical(first_char)
new_cabin

[n, C, n, C, n, ..., C, n, n, n, n]
Length: 156
Categories (8, object): [A, B, C, D, E, F, G, n]

In [24]:
# assign to the dataframe 
df['Cabin'] = new_cabin
df['Cabin'].value_counts()       #df.head()

n    125
C     10
D      6
B      5
F      4
E      3
A      2
G      1
Name: Cabin, dtype: int64

# finding  the null values and their index

In [28]:
df["Age"].isnull().value_counts() # here 30 null values are presents

False    126
True      30
Name: Age, dtype: int64

In [51]:
import numpy as np
missing = np.where(  df["Age"]  .  isnull() ) # indexs where null values are presents
print (missing)
print ('total number of null values = {}'.format (len(missing[0])))

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
        48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
       126, 128, 140, 154], dtype=int64),)
total number of null values = 30

## where clause

In [39]:
# find out the indexes at which fare is maximum
max_f = np.where( df.Fare == max(df.Fare))  # finding the index
max_f # indexes 
# to find records 
df.iloc[max_f]  # records

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0,C,S
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0,C,S

In [68]:
# find total family members form each family 
# find the max family member 

df["Total_family_members"] = df['SibSp'] + df['Parch']
max_family = np.where(df['Total_family_members']==max(df['Total_family_members']))
max_family
df.iloc[max_family]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Total_family_members
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9,n,S,7
71,72,0,3,"Goodwin, Miss. Lillian Amy",female,16.0,5,2,CA 2144,46.9,n,S,7

In [61]:
df.loc[ df.Total_family_members == max(df.Total_family_members)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Total_family_members
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9,n,S,7
71,72,0,3,"Goodwin, Miss. Lillian Amy",female,16.0,5,2,CA 2144,46.9,n,S,7

# some random examples

In [75]:
from numpy.random import randn as rn
# np.random.seed(100)
data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']
df1 = pd.DataFrame(data , index=row_labels,columns=column_headings)
df1

          W         X         Y         Z
A -1.704651 -1.136261 -2.973315  0.033317
B -0.248889 -0.450176  0.132428  0.022214
C  0.317368 -0.752414 -1.296392  0.095139
D -0.423715 -1.185984 -0.365462 -1.271023
E  1.586171  0.693391 -1.958081 -0.134801

In [86]:
df1.iloc[2 ,2:3:1]

Y   -1.296392
Name: C, dtype: float64

In [103]:
df1['total']= np.add(df1.W,df1.X)
df1.head()

          W         X         Y         Z     total
A -1.704651 -1.136261 -2.973315  0.033317 -2.840912
B -0.248889 -0.450176  0.132428  0.022214 -0.699065
C  0.317368 -0.752414 -1.296392  0.095139 -0.435046
D -0.423715 -1.185984 -0.365462 -1.271023 -1.609699
E  1.586171  0.693391 -1.958081 -0.134801  2.279562

In [106]:
df1.drop('W' , axis=1) # column w is removed

          X         Y         Z     total
A -1.136261 -2.973315  0.033317 -2.840912
B -0.450176  0.132428  0.022214 -0.699065
C -0.752414 -1.296392  0.095139 -0.435046
D -1.185984 -0.365462 -1.271023 -1.609699
E  0.693391 -1.958081 -0.134801  2.279562